app/Controllers/Kegiatan.php

SELECT *
FROM `kegiatan`
---
    public function index()
    {
        $model = new KegiatanModel();
        $kegiatan = $model->findAll();