app/Controllers/Mitra_Lapangan.php

    public function index()
    {

        $model = new MitraLapanganModel();
        $mitra_lapangan = $model->where('kategori', 'mitra lapangan')->findAll();
---
SELECT *
FROM `mitra`
WHERE `kategori` = 'mitra lapangan'