app/Controllers/Mitra_Pengolahan.php

    public function index()
    {

        $model = new MitraPengolahanModel();
        $mitra_pengolahan = $model->where('kategori', 'Mitra Pengolahan')->findAll();
---
SELECT *
FROM `mitra`
WHERE `kategori` = 'Mitra Pengolahan'